# Pandas

### What can we do with Pandas?
- It is used for reading and writing data in many formats.
- It intelligently grab data based on indexing, logic, subsetting and more.
- Handle missing data.
- Adjust and restructure data.

## Series

- It is a data structure in pandas that holds an array of information along with the named index.
- The named index differentiaties this from a simple Numpy array.
- Formal Definition: One-dimensional ndarray with axis labels.

In [1]:
import numpy as np
import pandas as pd

In [2]:
myindexx = ['USA', 'Canada', 'Mexico']
mydataa = [1776, 1867, 1821]

In [3]:
myser = pd.Series(data=mydataa, index=myindexx)

In [4]:
myser

USA       1776
Canada    1867
Mexico    1821
dtype: int64

In [5]:
myser['USA']

np.int64(1776)

In [6]:
ages = {'Sam': 25, 'Frank': 30, 'Dan': 22, 'John': 35}

In [7]:
pd.Series(ages)

Sam      25
Frank    30
Dan      22
John     35
dtype: int64

In [8]:
# Imaginary sales data for 1st and 2nd quarters for global companies
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100, 'China': 500, 'India': 210, 'USA': 260}

In [9]:
sales_q1 = pd.Series(q1)
sales_q2 = pd.Series(q2)

In [10]:
sales_q1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [11]:
sales_q2

Brazil    100
China     500
India     210
USA       260
dtype: int64

In [12]:
sales_q2.keys()

Index(['Brazil', 'China', 'India', 'USA'], dtype='object')

In [13]:
sales_q1 + sales_q2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [14]:
sales_q1.add(sales_q2, fill_value=0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

## DataFrames

- A dataframe is a table of columns and rows in pandas that we can easily restructure and filter
- Formal Definition: A group of pandas series objects that share the same index.

### Part 1: Creating a DataFrame

In [15]:
np.random.seed(101)
mydata = np.random.randint(0, 101, (4, 3))
myindex = ['CA', 'NY', 'AZ', 'TX']
mycols = ['Jan', 'Feb', 'Mar']

In [16]:
df = pd.DataFrame(data=mydata, index=myindex, columns=mycols)
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [17]:
pwd

'/Users/anurag_warthi/Downloads/Data-Science-Machine-Learning/Data Science/01-DS_Libraries'

In [18]:
# reading files using pandas
df = pd.read_csv('Files/tips.csv')

In [19]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

### Part 2: Basic Properties

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [21]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [22]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [23]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [24]:
df.head(10)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775

In [25]:
df.tail()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [26]:
df.describe()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

### Part 3: Working with Columns

In [27]:
df['total_bill']

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [28]:
# each of the columns in the dataframe is a pandas series
type(df['total_bill'])

pandas.core.series.Series

In [29]:
# Grabbing multiple columns
df[['total_bill', 'tip']]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

In [30]:
# Can perform operations on the series
df['tip'] + df['total_bill']

0      18.00
1      12.00
2      24.51
3      26.99
4      28.20
       ...
239    34.95
240    29.18
241    24.67
242    19.57
243    21.78
Length: 244, dtype: float64

In [31]:
# creating new columns in pandas
df['tip_percentage'] = (df['tip'] / df['total_bill']) * 100

In [32]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

In [33]:
df['price_per_person'] = df['total_bill'] / df['size']

In [34]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.495000,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.446667,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.003333,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.840000,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.147500,Tonya Carter,4832732618637221,Sun2251,14.680765

In [35]:
df['price_per_person'] = np.round(df['total_bill'] / df['size'], 2)

In [36]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765

In [37]:
# Dropping a column temperorily
df.drop('tip_percentage', axis=1)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [38]:
# Dropping a column permanently
df.drop('tip_percentage', axis=1, inplace = True)

In [39]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

### Part 4: Working with Rows

In [40]:
# Setting up index
df.set_index('Payment ID', inplace=True)

In [41]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221

In [42]:
df.index

Index(['Sun2959', 'Sun4608', 'Sun4458', 'Sun5260', 'Sun2251', 'Sun9679',
       'Sun5985', 'Sun8157', 'Sun6820', 'Sun3775',
       ...
       'Sat7220', 'Sat4615', 'Sat5032', 'Sat2929', 'Sat9777', 'Sat2657',
       'Sat1766', 'Sat3880', 'Sat17', 'Thur672'],
      dtype='object', name='Payment ID', length=244)

In [43]:
# Resetting index
df.reset_index()

,Payment ID,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
0,Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
1,Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
2,Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
3,Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
4,Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...,...
239,Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
240,Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
241,Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
242,Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
243,Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [44]:
# Grabbing the first row of the dataframe
df.iloc[0]

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [45]:
df.loc['Sun2959']

total_bill                       16.99
tip                               1.01
sex                             Female
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Name: Sun2959, dtype: object

In [46]:
# Grabbing multiple rows
df.iloc[0:3]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322

In [47]:
df.loc[['Sun2959', 'Sun4608']]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230

In [48]:
# dropping a row
df.drop('Sun2959', axis=0)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
Sun9679,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

In [49]:
# Adding a row
one_row = df.iloc[0]
df.loc[len(df)] = one_row

In [50]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410
Sun4608,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230
Sun4458,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322
Sun5260,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994
Sun2251,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221
...,...,...,...,...,...,...,...,...,...,...
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139
244,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410

In [51]:
df.drop(244, axis=0, inplace=True)

In [52]:
df.tail()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sat2657,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842
Sat1766,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404
Sat3880,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196
Sat17,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950
Thur672,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139

## Conditional Filtering

- Typically in data analysis our datasets are large enough that we don't filter based on position, but instead based on a condition.
- Conditional filtering allows us to select rows based on a condition on a column.
- This leads to a discussion on organizing our data.

- Conditional Filtering:
    - Filter by single condition
    - Filter by multiple condition
    - Check against multiple possible values

In [53]:
df = pd.read_csv('Files/tips.csv')

In [54]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [55]:
df[df['total_bill'] >= 40]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
95,40.17,4.73,Male,Yes,Fri,Dinner,4,10.04,Aaron Bentley,180026611638690,Fri9628
102,44.30,2.50,Female,Yes,Sat,Dinner,3,14.77,Heather Cohen,379771118886604,Sat6240
142,41.19,5.00,Male,No,Thur,Lunch,5,8.24,Eric Andrews,4356531761046453,Thur3621
156,48.17,5.00,Male,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
182,45.35,3.50,Male,Yes,Sun,Dinner,3,15.12,Jose Parsons,4112207559459910,Sun2337
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140
197,43.11,5.00,Female,Yes,Thur,Lunch,4,10.78,Brooke Soto,5544902205760175,Thur9313
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590

In [56]:
df[(df['total_bill'] >= 40) & (df['sex'] == 'Male')]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
95,40.17,4.73,Male,Yes,Fri,Dinner,4,10.04,Aaron Bentley,180026611638690,Fri9628
142,41.19,5.00,Male,No,Thur,Lunch,5,8.24,Eric Andrews,4356531761046453,Thur3621
156,48.17,5.00,Male,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
182,45.35,3.50,Male,Yes,Sun,Dinner,3,15.12,Jose Parsons,4112207559459910,Sun2337
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590

In [57]:
df[(df['total_bill'] >= 40) & (df['sex'] == 'Female')]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
102,44.30,2.5,Female,Yes,Sat,Dinner,3,14.77,Heather Cohen,379771118886604,Sat6240
197,43.11,5.0,Female,Yes,Thur,Lunch,4,10.78,Brooke Soto,5544902205760175,Thur9313

In [58]:
df[(df['total_bill'] >= 30) | (df['sex'] == 'Male')]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
...,...,...,...,...,...,...,...,...,...,...,...
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929
238,35.83,4.67,Female,No,Sat,Dinner,3,11.94,Kimberly Crane,676184013727,Sat9777
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17

In [59]:
df[(df['day'] == 'Sun') | (df['day'] == 'Sat') | (df['day'] == 'Fri')]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
238,35.83,4.67,Female,No,Sat,Dinner,3,11.94,Kimberly Crane,676184013727,Sat9777
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17

In [60]:
df[df['day'].isin(['Sun', 'Sat', 'Fri'])]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
238,35.83,4.67,Female,No,Sat,Dinner,3,11.94,Kimberly Crane,676184013727,Sat9777
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17

## Useful Methods

- While pandas has many built in methods, we can use the .apply() method call to apply any custom python function of our own to every row in a series.

### Part 1: Useful Methods - Apply on Single Column

In [61]:
df = pd.read_csv('Files/tips.csv')

In [62]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [63]:
def last_four(num):
    return str(num)[-4:]

df['CC Number'].apply(last_four)

0      3410
1      9230
2      1322
3      5994
4      7221
       ...
239    2842
240    5404
241    7196
242    0950
243    8139
Name: CC Number, Length: 244, dtype: object

In [64]:
# Getting the last 4 digits of a credit card number stored in a column 'CC Number'
df['CC Number'].apply(lambda x: str(x)[-4:])

0      3410
1      9230
2      1322
3      5994
4      7221
       ...
239    2842
240    5404
241    7196
242    0950
243    8139
Name: CC Number, Length: 244, dtype: object

### Part 2: Useful Methods - Apply on Multiple Columns

In [65]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [66]:
def quality(total_bill, tip):
    if tip/total_bill > 0.25:
        return "Generous"
    else:
        return "Other"

In [67]:
quality(16.99, 1.01)

'Other'

In [101]:
df[['total_bill', 'tip']].apply(lambda df: quality(df['total_bill'], df['tip']), axis=1).head()

0    Other
1    Other
2    Other
3    Other
4    Other
dtype: object

In [104]:
np.vectorize(quality)(df['total_bill'], df['tip'])[: 5]

array(['Other', 'Other', 'Other', 'Other', 'Other'], dtype='<U8')

In [71]:
import timeit

In [72]:
# code snippet to be executed only once.
setup = '''
import numpy as np
import pandas as pd
df = pd.read_csv('Files/tips.csv')
def quality(total_bill, tip):
    if tip/total_bill > 0.25:
        print("Generous")
    else:
        print("Other")
'''

In [73]:
stmt_one = '''
df['Tip Quality'] = df[['total_bill', 'tip']].apply(lambda df: quality(df['total_bill'], df['tip']), axis=1)
'''

stmt_two = ''' 
np.vectorize(quality)(df['total_bill'], df['tip'])
'''

In [114]:
#timeit.timeit(setup=setup, stmt=stmt_one, number=500)

In [113]:
#timeit.timeit(setup=setup, stmt=stmt_two, number=500)

### Part 3: Useful Methods - Statistical Information and Sorting

In [80]:
df = pd.read_csv('Files/tips.csv')

In [81]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15

In [82]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15

In [83]:
df.sort_values('tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
...,...,...,...,...,...,...,...,...,...,...,...
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954

In [84]:
df.sort_values('tip', ascending=False)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025
...,...,...,...,...,...,...,...,...,...,...,...
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780

In [85]:
df['total_bill'].max()

50.81

In [86]:
df['total_bill'].idxmax()

170

In [87]:
df.iloc[170]

total_bill                     50.81
tip                             10.0
sex                             Male
smoker                           Yes
day                              Sat
time                          Dinner
size                               3
price_per_person               16.94
Payer Name             Gregory Clark
CC Number           5473850968388236
Payment ID                   Sat1954
Name: 170, dtype: object

In [89]:
# Correlation
df.corr(numeric_only=True)

                  total_bill       tip      size  price_per_person  CC Number
total_bill          1.000000  0.675734  0.598315          0.647554   0.104576
tip                 0.675734  1.000000  0.489299          0.347405   0.110857
size                0.598315  0.489299  1.000000         -0.175359  -0.030239
price_per_person    0.647554  0.347405 -0.175359          1.000000   0.135240
CC Number           0.104576  0.110857 -0.030239          0.135240   1.000000

In [90]:
df['sex'].value_counts()

sex
Male      157
Female     87
Name: count, dtype: int64

In [91]:
df['day'].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [92]:
df.sex.replace({'Male': 'M', 'Female': 'F'})

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [93]:
df.drop_duplicates()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [96]:
df[df.total_bill.between(10, 20, inclusive = 'both')]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775
10,10.27,1.71,Male,No,Sun,Dinner,2,5.14,William Riley,566287581219,Sun2546
...,...,...,...,...,...,...,...,...,...,...,...
234,15.53,3.00,Male,Yes,Sat,Dinner,2,7.76,Tracy Douglas,4097938155941930,Sat7220
235,10.07,1.25,Male,No,Sat,Dinner,2,5.04,Sean Gonzalez,3534021246117605,Sat4615
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [99]:
# Largest in the rows
# Top 10 largest tips in the dataset
df.nlargest(10, 'tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025
183,23.17,6.50,Male,Yes,Sun,Dinner,4,5.79,Dr. Michael James,4718501859162,Sun6059
214,28.17,6.50,Female,Yes,Sat,Dinner,3,9.39,Marissa Jackson,4922302538691962,Sat3374
47,32.40,6.00,Male,No,Sun,Dinner,4,8.10,James Barnes,3552002592874186,Sun9677
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
88,24.71,5.85,Male,No,Thur,Lunch,2,12.36,Roger Taylor,4410248629955,Thur9003

In [100]:
df.nsmallest(2, 'tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
67,3.07,1.0,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455
92,5.75,1.0,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780

### Missing Data

Options for missing data
- Keep it
- Remove it
- Replace it

### Keeping the missing data
Pros
- Easiest to do
- Does not manipulate or change the true data

Cons
- Many methods do not support NaN
- Often there are reasonable guesses 

### Dropping or Removing the missing data
Pros
- Easy to do
- Can be based on rules

Cons
- Potential to lose a lot of data or useful information
- Limits trained models for future data

### Filling in the missing data
Pros
- Potential to save a lot of data for use in training a model

Cons
- Hardest to do and somewhat arbitrary
- Potential to lead to false conclusions

In [107]:
np.nan

nan

In [108]:
pd.NA

In [109]:
# NaN value comparison
np.nan == np.nan

False

In [110]:
np.nan is np.nan

True

In [111]:
df = pd.read_csv('Files/movie_scores.csv')

In [112]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [116]:
df.isnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [117]:
df.isna()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [119]:
# Dropping the data
# dropping all null values
df.dropna()

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [120]:
# Dropping all the rows unless there is 1 non null value
df.dropna(thresh=1)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [121]:
# Drop if any particular column is Null
df.dropna(subset=['last_name'])

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [122]:
df.fillna('New Value')

  first_name  last_name        age        sex pre_movie_score post_movie_score
0        Tom      Hanks       63.0          m             8.0             10.0
1  New Value  New Value  New Value  New Value       New Value        New Value
2       Hugh    Jackman       51.0          m       New Value        New Value
3      Oprah    Winfrey       66.0          f             6.0              8.0
4       Emma      Stone       31.0          f             7.0              9.0

In [127]:
df.pre_movie_score.fillna(df.pre_movie_score.mean())

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [128]:
airline_tix = {'first': 100, 'business': np.nan, 'economy-plus': 50, 'economy': 30}

In [129]:
ser = pd.Series(airline_tix)

In [130]:
ser

first           100.0
business          NaN
economy-plus     50.0
economy          30.0
dtype: float64

In [131]:
ser.interpolate()

first           100.0
business         75.0
economy-plus     50.0
economy          30.0
dtype: float64

### Group By Operations

A groupby() operation allows us to examine data on a per category basis.

In [159]:
pd.set_option('Display.max_rows', None)

In [132]:
df = pd.read_csv('Files/mpg.csv')

In [133]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [160]:
df.groupby(by = ['mpg', 'cylinders', 'displacement', 'horsepower', 'weight', 'acceleration', 'origin', 'name'])['model_year'].mean()

mpg   cylinders  displacement  horsepower  weight  acceleration  origin  name
9.0   8          304.0         193         4732    18.5          1       hi 1200d                                70.0
10.0  8          307.0         200         4376    15.0          1       chevy c20                               70.0
                 360.0         215         4615    14.0          1       ford f250                               70.0
11.0  8          318.0         210         4382    13.5          1       dodge d200                              70.0
                 350.0         180         3664    11.0          1       oldsmobile omega                        73.0
                 400.0         150         4997    14.0          1       chevrolet impala                        73.0
                 429.0         208         4633    11.0          1       mercury marquis                         72.0
12.0  8          350.0         160         4456    13.5          1       oldsmobile delta 88 royale              72.0
                               180         4499    12.5          1       oldsmobile vista cruiser                73.0
                 383.0         180         4955    11.5          1       dodge monaco (sw)                       71.0
                 400.0         167         4906    12.5          1       ford country                            73.0
                 429.0         198         4952    11.5          1       mercury marquis brougham                73.0
                 455.0         225         4951    11.0          1       buick electra 225 custom                73.0
13.0  8          302.0         129         3169    12.0          1       ford mustang ii                         75.0
                               130         3870    15.0          1       ford f108                               76.0
                               140         4294    16.0          1       ford gran torino (sw)                   72.0
                 307.0         130         4098    14.0          1       chevrolet chevelle concours (sw)        72.0
                 318.0         150         3755    14.0          1       dodge d100                              76.0
                                           3940    13.2          1       plymouth volare premier v8              76.0
                 350.0         145         3988    13.0          1       chevrolet malibu                        73.0
                                           4055    12.0          1       chevy c10                               76.0
                               150         4699    14.5          1       buick century luxus (sw)                74.0
                               155         4502    13.5          1       buick lesabre custom                    72.0
                               165         4274    12.0          1       chevrolet impala                        72.0
                               175         4100    13.0          1       buick century 350                       73.0
                 351.0         158         4363    13.0          1       ford ltd                                73.0
                 360.0         170         4654    13.0          1       plymouth custom suburb                  73.0
                               175         3821    11.0          1       amc ambassador brougham                 73.0
                 400.0         150         4464    12.0          1       chevrolet caprice classic               73.0
                               170         4746    12.0          1       ford country squire (sw)                71.0
                               175         5140    12.0          1       pontiac safari (sw)                     71.0
                               190         4422    12.5          1       chrysler newport royal                  72.0
                 440.0         215         4735    11.0          1       chrysler new yorker brougham            73.0
14.0  8          302.0         137         4042    14.5          1       ford gran torino                        73.0
                               140         4638    16.0          1       ford gran torino (sw)                   74.0
                 304.0         150         3672    11.5          1       amc matador                             73.0
                                           4257    15.5          1       amc matador (sw)                        74.0
                 318.0         150         4077    14.0          1       plymouth satellite custom (sw)          72.0
                                           4096    13.0          1       plymouth fury iii                       71.0
                                           4237    14.5          1       plymouth fury gran sedan                73.0
                                           4457    13.5          1       dodge coronet custom (sw)               74.0
                 340.0         160         3609    8.0           1       plymouth 'cuda 340                      70.0
                 350.0         165         4209    12.0          1       chevrolet impala                        71.0
                 351.0         148         4657    13.5          1       ford ltd                                75.0
                               153         4129    13.0          1       ford galaxie 500                        72.0
                                           4154    13.5          1       ford galaxie 500                        71.0
                 400.0         175         4385    12.0          1       pontiac catalina                        72.0
                                           4464    11.5          1       pontiac catalina brougham               71.0
                 440.0         215         4312    8.5           1       plymouth fury iii                       70.0
                 454.0         220         4354    9.0           1       chevrolet impala                        70.0
                 455.0         225         3086    10.0          1       buick estate wagon (sw)                 70.0
                                           4425    10.0          1       pontiac catalina                        70.0
14.5  8          351.0         152         4215    12.8          1       ford gran torino                        76.0
15.0  6          250.0         100         3336    17.0          1       chevrolet nova                          74.0
                               72          3158    19.5          1       ford maverick                           75.0
                                           3432    21.0          1       mercury monarch                         75.0
                 258.0         110         3730    19.0          1       amc matador                             75.0
      8          302.0         130         4295    14.9          1       mercury cougar brougham                 77.0
                 304.0         150         3892    12.5          1       amc matador (sw)                        72.0
                 318.0         150         3399    11.0          1       dodge dart custom                       73.0
                                           3777    12.5          1       dodge coronet custom                    73.0
                                           4135    13.5          1       plymouth fury iii                       72.0
                 350.0         145         4082    13.0          1       chevrolet monte carlo s                 73.0
                                           4440    14.0          1       chevrolet bel air                       75.0
                               165         3693    11.5          1       buick skylark 320                       70.0
                 383.0         170         3563    10.0          1       dodge challenger se                     70.0
                 390.0         190         3850    8.5           1       amc ambassador dpl                      70.0
                 400.0         150         3761    9.5           1       chevrolet monte carlo                   70.0
                 429.0         198         4341    10.0          1       ford galaxie 500                        70.0
15.5  8          304.0         120         3962    13.9          1       amc matador                             76.0
                 318.0         145         4140    13.7          1       dodge monaco brougham                   77.0
                 350.0         170         4165    11.4          1       chevrolet monte carlo landau            77.0
                 351.0         142         4054    14.3          1       ford country squire (sw)                79.0
                 400.0         190         4325    12.2          1       chrysler cordoba                        77.0
16.0  6          225.0         105         3439    15.5          1       plymouth satellite custom               71.0
                 250.0         100         3278    18.0          1       chevrolet nova custom                   73.0
                                           3781    17.0          1       chevrolet chevelle malibu classic       74.0
                               105         3897    18.5          1       chevroelt chevelle malibu               75.0
                 258.0         110         3632    18.0          1       amc matador                             74.0
      8          302.0         140         4141    14.0          1       ford gran torino                        74.0
                 304.0         150         3433    12.0          1       amc rebel sst                           70.0
                 318.0         150         4190    13.0          1       dodge coronet brougham                  76.0
                                           4498    14.5          1       plymouth grand fury                     75.0
                 351.0         149         4335    14.5          1       ford thunderbird                        77.0
                 400.0         170         4668    11.5          1       pontiac catalina                        75.0
                               180         4220    11.1          1       pontiac grand prix lj                   77.0
                               230         4278    9.5           1       pontiac grand prix                      73.0
16.2  6          163.0         133         3410    15.8          2       peugeot 604sl                           78.0
16.5  6          168.0         120         3820    16.7          2       mercedes-benz 280s                      76.0
      8          350.0         180         4380    12.1          1       cadillac seville                        76.0
                 351.0         138         3955    13.2          1       mercury grand marquis                   79.0
16.9  8          350.0         155         4360    14.9          1       buick estate wagon (sw)                 79.0
17.0  6          163.0         125         3140    13.6          2       volvo 264gl                             78.0
                 231.0         110         3907    21.0          1       buick century                           75.0
                 250.0         100         3329    15.5          1       chevrolet chevelle malibu               71.0
      8          260.0         110         4060    19.0          1       oldsmobile cutlass supreme              77.0
                 302.0         140         3449    10.5          1       ford torino                             70.0
                 304.0         150         3672    11.5          1       amc ambassador sst                      72.0
                 305.0         130         3840    15.4          1       chevrolet caprice classic               79.0
17.5  6          250.0         110         3520    16.4          1       chevrolet concours                      77.0
                 258.0         95          3193    17.8          1       amc pacer d/l                           76.0
      8          305.0         140         4215    13.0          1       chevrolet chevelle malibu classic       76.0
                               145         3880    12.5          1       chevrolet caprice classic               77.0
                 318.0         140         4080    13.7          1       dodge magnum xe                         78.0
17.6  6          225.0         85          3465    16.6          1       chrysler lebaron salon                  81.0
      8          302.0         129         3725    13.4          1       ford ltd landau                         79.0
17.7  6          231.0         165         3445    13.4          1       buick regal sport coupe (turbo)         78.0
18.0  3          70.0          90          2124    13.5          3       maxda rx3                               73.0
      4          121.0         112         2933    14.5          2       volvo 145e (sw)                         72.0
      6          171.0         97          2984    14.5          1       ford pinto                              75.0
                 199.0         97          2774    15.5          1       amc hornet                              70.0
                 225.0         105         3121    16.5          1       plymouth valiant                        73.0
                                           3613    16.5          1       plymouth satellite sebring              74.0
                               95          3785    19.0          1       plymouth fury                           75.0
                 232.0         100         2789    15.0          1       amc gremlin                             73.0
                                           2945    16.0          1       amc hornet                              73.0
                                           3288    15.5          1       amc matador                             71.0
                 250.0         105         3459    16.0          1       chevrolet nova                          75.0
                               78          3574    21.0          1       ford granada ghia                       76.0
                               88          3021    16.5          1       ford maverick                           73.0
                                           3139    14.5          1       ford mustang                            71.0
                 258.0         110         2962    13.5          1       amc hornet sportabout (sw)              71.0
      8          307.0         130         3504    12.0          1       chevrolet chevelle malibu               70.0
                 318.0         150         3436    11.0          1       plymouth satellite                      70.0
18.1  6          258.0         120         3410    15.1          1       amc concord d/l                         78.0
      8          302.0         139         3205    11.2          1       ford futura                             78.0
18.2  8          318.0         135         3830    15.2          1       dodge st. regis                         79.0
18.5  6          250.0         110         3645    16.2          1       pontiac ventura sj                      76.0
                               98          3525    19.0          1       ford granada                            77.0
      8          360.0         150         3940    13.0          1       chrysler lebaron town @ country (sw)    79.0
18.6  6          225.0         110         3620    18.7          1       dodge aspen                             78.0
19.0  3          70.0          97          2330    13.5          3       mazda rx2 coupe                         72.0
      4          120.0         88          3270    21.9          2       peugeot 504                             76.0
                 121.0         112         2868    15.5          2       volvo 144ea                             73.0
                 122.0         85          2310    18.5          1       ford pinto                              73.0
      6          156.0         108         2930    15.5          3       toyota mark ii                          76.0
                 225.0         100         3630    17.7          1       plymouth volare custom                  77.0
                               95          3264    16.0          1       plymouth valiant custom                 75.0
                 232.0         100         2634    13.0          1       amc gremlin                             71.0
                                           2901    16.0          1       amc hornet                              74.0
                               90          3211    17.0          1       amc pacer                               75.0
                 250.0         100         3282    15.0          1       pontiac firebird                        71.0
                               88          3302    15.5          1       ford torino 500                         71.0
19.1  6          225.0         90          3381    18.7          1       dodge aspen                             80.0
19.2  6          231.0         105         3535    19.2          1       pontiac phoenix lj                      78.0
      8          267.0         125         3605    15.0          1       chevrolet malibu classic (sw)           79.0
                 305.0         145         3425    13.2          1       chevrolet monte carlo landau            78.0
19.4  6          232.0         90          3210    17.2          1       amc concord                             78.0
      8          318.0         140         3735    13.2          1       dodge diplomat                          78.0
19.8  6          200.0         85          2990    18.2          1       mercury zephyr 6                        79.0
19.9  8          260.0         110         3365    15.5          1       oldsmobile cutlass salon brougham       78.0
20.0  4          97.0          88          2279    19.0          3       toyota carina                           73.0
                 114.0         91          2582    14.0          2       audi 100ls                              73.0
                 130.0         102         3150    15.7          2       volvo 245                               76.0
                 140.0         90          2408    19.5          1       chevrolet vega                          72.0
      6          156.0         122         2807    13.5          3       toyota mark ii                          73.0
                 198.0         95          3102    16.5          1       plymouth duster                         74.0
                 225.0         100         3651    17.7          1       dodge aspen se                          76.0
                 232.0         100         2914    16.0          1       amc gremlin                             75.0
      8          262.0         110         3221    13.5          1       chevrolet monza 2+2                     75.0
20.2  6          200.0         85          2965    15.8          1       ford fairmont (auto)                    78.0
                               88          3060    17.1          1       ford granada gl                         81.0
                 232.0         90          3265    18.2          1       amc concord dl 6                        79.0
      8          302.0         139         3570    12.8          1       mercury monarch ghia                    78.0
20.3  5          131.0         103         2830    15.9          2       audi 5000                               78.0
20.5  6          200.0         95          3155    18.2          1       chevrolet malibu                        78.0
                 225.0         100         3430    17.2          1       plymouth volare                         78.0
                 231.0         105         3425    16.9          1       buick skylark                           77.0

In [155]:
df.groupby('origin')['name'].count()

origin
1    249
2     70
3     79
Name: name, dtype: int64

Aggregation Functions which can be used on group by 

- mean(): Compute mean of groups
- sum(): Compute sum of group values
- size(): Compute group sizes
- count(): Compute count of groups
- std(): Standard deviation of groups
- var(): Compute variance of groups
- sem(): Standard error of the mean of groups
- describe(): Generates descriptive statistics
- first(): Compute first of group values
- last(): Compute last of group values
- nth: Take nth value or a subset if n is a list
- min(): Compute min of group values
- max(): Compute max of group values